akomakom/esp32-spa-controller/controller/ESPNowUtils.cpp
/*
  Rui Santos
  Complete project details at https://RandomNerdTutorials.com/?s=esp-now
  Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files.
  The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
  Based on JC Servaye example: https://github.com/Servayejc/esp_now_web_server/
*/

#include "ESPNowUtils.h"

void ESPNowUtils::readDataToSend() {
//    outgoingSetpoints.msgType = CONTROL_STATUS;
//    outgoingSetpoints.board_id = 0;
//    outgoingSetpoints.value=222;
//    outgoingSetpoints.temp = random(0, 40);
//    outgoingSetpoints.hum = random(0, 100);
//    outgoingSetpoints.readingId = counter++;
}


// ---------------------------- esp_ now -------------------------
void ESPNowUtils::printMAC(const uint8_t * mac_addr){
    char macStr[18];
    snprintf(macStr, sizeof(macStr), "%02x:%02x:%02x:%02x:%02x:%02x",
             mac_addr[0], mac_addr[1], mac_addr[2], mac_addr[3], mac_addr[4], mac_addr[5]);
    Serial.print(macStr);
}

bool ESPNowUtils::addPeer(const uint8_t *peer_addr) {      // add pairing
    memset(&slave, 0, sizeof(slave));
    const esp_now_peer_info_t *peer = &slave;
    memcpy(slave.peer_addr, peer_addr, 6);

//    slave.channel = WiFi.channel(); // pick a channel
    slave.encrypt = 0; // no encryption
    // check if the peer exists
    bool exists = esp_now_is_peer_exist(slave.peer_addr);
    if (exists) {
        // Slave already paired.
        Serial.println("Already Paired");
        return true;
    }
    else {
        esp_err_t addStatus = esp_now_add_peer(peer);
        if (addStatus == ESP_OK) {
            // Pair success
            Serial.println("Pair success");
            return true;
        }
        else
        {
            Serial.println("Pair failed");
            return false;
        }
    }
}

// callback when data is sent
// Arduino-ESP32 3.1 changed the send-callback signature from (mac_addr) to
// (esp_now_send_info_t* = wifi_tx_info_t), where des_addr is the peer MAC.
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 1, 0)
void ESPNowUtils::OnDataSent(const esp_now_send_info_t *tx_info, esp_now_send_status_t status) {
    const uint8_t *mac_addr = tx_info->des_addr;
#else
void ESPNowUtils::OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
#endif
    Serial.print("Last Packet Send Status: ");
    Serial.print(status == ESP_NOW_SEND_SUCCESS ? "Delivery Success to " : "Delivery Fail to ");
    printMAC(mac_addr);
    Serial.println();
}

void ESPNowUtils::OnDataRecv(const esp_now_recv_info* info, const uint8_t *incomingData, int len) {
    uint8_t * mac_addr = info->src_addr;
    Serial.print(len);
    Serial.print(" bytes of data received from : ");
    printMAC(mac_addr);
    Serial.println();
    StaticJsonDocument<1000> root;
    uint8_t type = incomingData[0];       // first message byte is the type of message
    switch (type) {
        case COMMAND :                           // the message is data type
            memcpy(&incomingCommand, incomingData, sizeof(incomingCommand));
            if (commandCallback != NULL) {
                commandCallback(&incomingCommand);
            }
//            // create a JSON document with received data and send it by event to the web page
//            root["id"] = incomingReadings.board_id;
//            root["temperature"] = incomingReadings.temp;
//            root["humidity"] = incomingReadings.hum;
//            root["readingId"] = String(incomingReadings.readingId);
//            Serial.print("event send :");
//            serializeJson(root, Serial);
//            Serial.println();
            break;

        case PAIRING:                            // the message is a pairing request
            memcpy(&pairingData, incomingData, sizeof(pairingData));
            Serial.println(pairingData.msgType);
            Serial.println(pairingData.board_id);
            Serial.printf("Pairing request on channel %d (we are on %d) from: ", pairingData.channel, WiFi.channel());
            printMAC(mac_addr);
            Serial.println();
            WiFi.printDiag(Serial);
            if (pairingData.board_id > 0) {     // do not replay to server itself
                if (pairingData.msgType == PAIRING) {
                    pairingData.board_id = 0;       // 0 is server
                    // Server is in AP_STA mode: peers need to send data to server soft AP MAC address
                    WiFi.softAPmacAddress(pairingData.macAddr);
                    // Tell the peer our ACTUAL channel, not the channel it guessed in its
                    // request. Otherwise the peer locks onto the wrong channel (e.g. it
                    // scanned ch 7 while we are on ch 6) and can never hear us again.
                    pairingData.channel = WiFi.channel();
                    Serial.println("send pairing response");
                    esp_err_t result = esp_now_send(mac_addr, (uint8_t *) &pairingData, sizeof(pairingData));
                    if (addPeer(mac_addr)) {
                        if (pairedCallback != NULL) {
                            pairedCallback(&pairingData);
                        }
                    }
                }
            }
            break;
    }
}

void ESPNowUtils::registerCommandCallBackHandler(hot_tub_command_recv_callback callbackFunc) {
    commandCallback = callbackFunc;
}
void ESPNowUtils::registerPairingCallBackHandler(ESPNowUtils::hot_tub_paired_callback callbackFunc) {
    pairedCallback = callbackFunc;
}

void ESPNowUtils::sendStatusControl() {
    esp_now_send(NULL, (uint8_t *) &outgoingStatusControl, sizeof(outgoingStatusControl));
}
void ESPNowUtils::sendStatusServer() {
    esp_now_send(NULL, (uint8_t *) &outgoingStatusServer, sizeof(outgoingStatusServer));
}

void ESPNowUtils::initESP_NOW() {
    // Init ESP-NOW
    if (esp_now_init() != ESP_OK) {
        Serial.println("Error initializing ESP-NOW");
        return;
    }
    esp_now_register_send_cb(OnDataSent);
    esp_now_register_recv_cb(OnDataRecv);
}

void ESPNowUtils::setup() {
    Serial.print("Server SOFT AP MAC Address:  ");
    Serial.println(WiFi.softAPmacAddress());

    Serial.print("Station IP Address: ");
    Serial.println(WiFi.localIP());
    Serial.print("Wi-Fi Channel: ");
    Serial.println(WiFi.channel());

    initESP_NOW();

    outgoingStatusControl.board_id = 0;
    outgoingStatusServer.board_id = 0;
}

void ESPNowUtils::loop() {
//    static unsigned long lastEventTime = millis();
//    static const unsigned long EVENT_INTERVAL_MS = 5000;
//    if ((millis() - lastEventTime) > EVENT_INTERVAL_MS) {
//        lastEventTime = millis();
//        readDataToSend();
//        esp_now_send(NULL, (uint8_t *) &outgoingSetpoints, sizeof(outgoingSetpoints));
//    }
}